In [1]:
import pandas as pd

In [2]:
import requests as req

In [3]:
url = "https://www.forbes.com/ajax/list/data?year=2022&uri=billionaires&type=person"

In [4]:
res = req.get(url)

In [5]:
data = res.json()

In [6]:
data[100]

{'position': 52,
 'rank': 52,
 'name': 'Leonardo Del Vecchio',
 'lastName': 'Del Vecchio',
 'uri': 'leonardo-del-vecchio',
 'imageUri': 'leonardo-del-vecchio',
 'worth': 27300.0,
 'worthChange': 0.0,
 'age': 87,
 'source': 'eyeglasses',
 'industry': 'Fashion & Retail',
 'gender': 'M',
 'country': 'Italy',
 'timestamp': 1655563202839,
 'realTimeWorth': 23681.395,
 'realTimeRank': 60,
 'realTimePosition': 60,
 'squareImage': 'https://specials-images.forbesimg.com/imageserve/605e2e8ca4f18e06b39d9142/416x416.jpg?background=000000&cropX1=0&cropX2=1384&cropY1=0&cropY2=1384'}

In [7]:
df = pd.DataFrame.from_records(data)

In [8]:
df

,name,lastName,uri,imageUri,worthChange,age,source,industry,gender,country,...,headquarters,state,position,rank,worth,title,government,pay,managementAssets,salary
0,Albert Avdolyan,Avdolyan,albert-avdolyan,no-pic,0.0,51.0,"oil, mining",Energy,M,Russia,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Alexander Dzhaparidze,Dzhaparidze,alexander-dzhaparidze,alexander-dzhaparidze,0.0,66.0,oil services,Energy,M,Russia,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Alexander Klyachin,Klyachin,alexander-klyachin,no-pic,0.0,55.0,real estate,Real Estate,M,Russia,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Alexandr Wang,Wang,alexandr-wang,no-pic,0.0,25.0,artificial intelligence,Technology,M,United States,...,CA,California,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Anatoly Sedykh,Sedykh,anatoly-sedykh,anatoly-sedykh,0.0,57.0,steel pipes,Metals & Mining,M,Russia,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2712,Zhang Yuqiang,Zhang,zhang-yuqiang,no-pic,NaN,66.0,Fiberglass,Manufacturing,M,China,...,NaN,NaN,2664.0,2578.0,1000.0,NaN,NaN,NaN,NaN,NaN
2713,Zhou Ruxin,Zhou,zhou-ruxin,no-pic,NaN,59.0,Navigation,Technology,M,China,...,NaN,NaN,2665.0,2578.0,1000.0,NaN,NaN,NaN,NaN,NaN
2714,Wen Zhou,Zhou,wen-zhou,no-pic,0.0,57.0,chemicals,Manufacturing,M,China,...,NaN,NaN,2666.0,2578.0,1000.0,NaN,NaN,NaN,NaN,NaN
2715,Zhou Yifeng,Zhou,zhou-yifeng,no-pic-female,NaN,43.0,liquefied petroleum gas,Energy,F,China,...,NaN,NaN,2667.0,2578.0,1000.0,NaN,NaN,NaN,NaN,NaN
2716,Zhuang Kuilong,Zhuang,zhuang-kuilong,no-pic,NaN,60.0,polyester,Manufacturing,M,China,...,NaN,NaN,2668.0,2578.0,1000.0,NaN,NaN,NaN,NaN,NaN

In [9]:
url_tmpl = "https://www.forbes.com/ajax/list/data?year={}&uri=billionaires&type=person"

In [12]:
for year in range(1997, 2023):
    print(year)
    fn = f"../source/forbes2/{year}.csv"
    df = get_data(year)
    df.to_csv(fn, index=False)

1997
1998
1999
2000
2001
2002
2003
2004
2005
2006
2007
2008
2009
2010
2011
2012
2013
2014
2015
2016
2017
2018
2019
2020
2021

In [11]:
def get_data(year):
    res = req.get(url_tmpl.format(year)).json()
    df = pd.DataFrame.from_records(res)
    return df

In [14]:
df = get_data(2022)
df.to_csv('../source/forbes2/2022.csv', index=False)

In [21]:
get_data(1998).iloc[0]

name                                                  A. Jayson Adair
lastName                                                        Adair
uri                                                    a-jayson-adair
imageUri                                                       no-pic
worthChange                                                   -32.566
age                                                              52.0
source                                                   damaged cars
industry                                                   Automotive
gender                                                              M
country                                                 United States
timestamp                                               1643253901890
headquarters                                                       TX
state                                                           Texas
realTimeWorth                                                 1167.09
realTimeRank                                                   2381.0
realTimePosition                                               2381.0
squareImage         https://specials-images.forbesimg.com/imageser...
worth                                                             NaN
position                                                          NaN
rank                                                              NaN
Name: 0, dtype: object

In [22]:
cols = ['name', 'age', 'country', 'realTimeWorth']

In [23]:
def get_data_file(year):
    fn = f"../source/{year}.csv"
    return pd.read_csv(fn)

In [28]:
df = get_data_file(2021)

In [29]:
df.loc[0]

name                                                        Abhay Soi
lastName                                                          Soi
uri                                                         abhay-soi
imageUri                                                       no-pic
worthChange                                                       0.0
age                                                              48.0
source                                                     healthcare
industry                                                   Healthcare
gender                                                              M
country                                                         India
timestamp                                               1643251502564
realTimeWorth                                                1067.196
realTimeRank                                                   2502.0
realTimePosition                                               2502.0
squareImage         https://specials-images.forbesimg.com/imageser...
headquarters                                                      NaN
state                                                             NaN
position                                                          NaN
rank                                                              NaN
worth                                                             NaN
title                                                             NaN
government                                                        NaN
pay                                                               NaN
managementAssets                                                  NaN
salary                                                            NaN
Name: 0, dtype: object

In [31]:
df['realTimeWorth'].dropna()

0       1067.196
1       1760.863
2       1457.710
3       4000.000
4       1283.846
          ...
2896    1299.318
2897    1249.054
2898    1000.000
2899    1045.538
2901    1003.500
Name: realTimeWorth, Length: 2594, dtype: float64

In [33]:
df.set_index('uri')[['realTimeWorth', 'worth']]

                     realTimeWorth   worth
uri
abhay-soi                 1067.196     NaN
adam-foroughi             1760.863     NaN
adam-neumann              1457.710     NaN
alex-shevchenko           4000.000     NaN
anand-deshpande           1283.846     NaN
...                            ...     ...
daniel-yong-zhang-1       1003.500  1000.0
zhang-yuqiang                  NaN  1000.0
zhao-meiguang                  NaN  1000.0
zhong-naixiong                 NaN  1000.0
zhou-wei-1                     NaN  1000.0

[2906 rows x 2 columns]

In [34]:
url_profile_tmpl = "https://www.forbes.com/profile/{}"

In [37]:
pf = url_profile_tmpl.format("abhay-soi")

In [38]:
pf

'https://www.forbes.com/profile/abhay-soi'

In [3]:
tb = pd.read_stata("../source/Billionaires1996-2014.dta")

In [6]:
tb.name.unique()

array(['Isabel dos Santos', 'Sheikh Zayed Bin Sultan Al Nahyan',
       'Makhtoum bin Rashid Al Maktoum', ...,
       'Nicky Oppenheimer & family', 'Allan Gray', 'Koos Bekker'],
      dtype=object)

In [7]:
df = pd.read_csv('../source/1997.csv')

In [12]:
names = df[pd.isnull(df.worth)].name.unique()

In [33]:
tb[(tb.name.isin(names)) & (tb.year == 1998)]

,name,year,rank,citizenship,countrycode,networthusbillion,age,sourceofwealth,IndustryAggregates,north,region,industry,company,deflator1996,realnetworth,realbillionaires,gdpcurrentus
125,Frank Lowy,1998.0,198.0,Australia,AUS,1.6,67.0,,Financial,1.0,North America,Real Estate,,102.734375,1.557414,1.0,3.993251e+11
465,Julio Bozano,1998.0,156.0,Brazil,BRA,2.2,62.0,,Financial,0.0,Latin America,Money Management,,102.734375,2.141445,1.0,8.668421e+11
875,Charles Bronfman,1998.0,103.0,Canada,CAN,3.3,66.0,,Traded Sectors,1.0,North America,Consumer,,102.734375,3.212167,1.0,6.314324e+11
1300,Ernesto Bertarelli,1998.0,83.0,Switzerland,CHE,4.0,32.0,,New Sectors,1.0,Europe,Technology-Medical,Serono,102.734375,3.893536,1.0,2.949775e+11
2870,August von Finck,1998.0,76.0,Germany,DEU,4.5,67.0,,Financial,1.0,Europe,Money Management,,102.734375,4.380228,1.0,2.239913e+12
4329,Alain Wertheimer,1998.0,168.0,France,FRA,2.1,0.0,,Traded Sectors,1.0,Europe,Consumer,,102.734375,2.044106,1.0,1.510758e+12
8122,Emilio Azcarraga Jean,1998.0,99.0,Mexico,MEX,3.5,30.0,,Non-Traded Sectors,0.0,Latin America,Media,,102.734375,3.406844,1.0,5.020103e+11
8525,Frits Goldschmeding,1998.0,153.0,Netherlands,NLD,2.3,64.0,,other,1.0,Europe,Other,,102.734375,2.238783,1.0,4.311742e+11
10912,Douglas Hsu,1998.0,173.0,Taiwan,Taiwan,2.0,56.0,,Financial,0.0,East Asia,Money Management,,102.734375,1.946768,1.0,NaN
11445,David Geffen,1998.0,171.0,United States,USA,2.0,55.0,,Non-Traded Sectors,1.0,North America,Media,,102.734375,1.946768,1.0,9.089168e+12
11446,George Soros,1998.0,96.0,United States,USA,3.6,67.0,,Financial,1.0,North America,Hedge funds,,102.734375,3.504182,1.0,9.089168e+12
11450,Gordon Moore,1998.0,29.0,United States,USA,7.5,69.0,,New Sectors,1.0,North America,Technology-Computer,,102.734375,7.300380,1.0,9.089168e+12
11454,Donald Bren,1998.0,132.0,United States,USA,2.6,65.0,,Financial,1.0,North America,Real Estate,,102.734375,2.530798,1.0,9.089168e+12
11465,George Lucas,1998.0,178.0,United States,USA,2.0,53.0,,Non-Traded Sectors,1.0,North America,Media,,102.734375,1.946768,1.0,9.089168e+12
11483,James Goodnight,1998.0,134.0,United States,USA,2.6,55.0,,New Sectors,1.0,North America,Technology-Computer,,102.734375,2.530798,1.0,9.089168e+12
11487,Dennis Washington,1998.0,209.0,United States,USA,1.5,63.0,,Non-Traded Sectors,1.0,North America,Constrution,,102.734375,1.460076,1.0,9.089168e+12
11494,Bill Gates,1998.0,1.0,United States,USA,51.0,42.0,,New Sectors,1.0,North America,Technology-Computer,Microsoft,102.734375,49.642586,1.0,9.089168e+12
11496,Craig McCaw,1998.0,41.0,United States,USA,6.4,48.0,,Non-Traded Sectors,1.0,North America,Media,,102.734375,6.229658,1.0,9.089168e+12
11502,Carl Icahn,1998.0,175.0,United States,USA,2.0,62.0,,Financial,1.0,North America,Private equity/leveraged buyout,,102.734375,1.946768,1.0,9.089168e+12

In [18]:
df[df.name == "Frank Lowy"].iloc[0]

name                                                       Frank Lowy
lastName                                                         Lowy
uri                                                        frank-lowy
imageUri                                                   frank-lowy
worthChange                                                    10.555
age                                                              91.0
source                                                 shopping malls
industry                                                  Real Estate
gender                                                              M
country                                                     Australia
timestamp                                               1643251502563
headquarters                                                      NaN
state                                                             NaN
realTimeWorth                                                4849.049
realTimeRank                                                    590.0
realTimePosition                                                590.0
squareImage         //specials-images.forbesimg.com/imageserve/5e7...
worth                                                             NaN
position                                                          NaN
rank                                                              NaN
Name: 661, dtype: object

In [23]:
tb[tb.name == "Frank Lowy"][['name', 'year', 'networthusbillion']]

           name            year  networthusbillion
123  Frank Lowy          1997.0                1.2
125  Frank Lowy          1998.0                1.6
128  Frank Lowy          1999.0                1.8
130  Frank Lowy          2000.0                2.1
132  Frank Lowy          2001.0                2.2
137  Frank Lowy          2002.0                2.1
138  Frank Lowy          2003.0                1.8
142  Frank Lowy          2004.0                2.4
147  Frank Lowy          2005.0                3.6
152  Frank Lowy          2006.0                3.8
162  Frank Lowy          2007.0                4.6
174  Frank Lowy          2008.0                4.6
186  Frank Lowy          2009.0                2.7
195  Frank Lowy          2010.0                3.6
218  Frank Lowy          2011.0                4.4
239  Frank Lowy          2012.0                4.4
259  Frank Lowy          2013.0                5.3
276  Frank Lowy          2014.0                4.7
297  Frank Lowy          2015.0                4.9
335  Frank Lowy  September 2015                4.3

In [4]:
res = []
for year in range(1997, 2022):
    fn = f'../source/{year}.csv'
    df = pd.read_csv(fn)
    df['year'] = year
    res.append(df)

res = pd.concat(res)

In [29]:
res[res.name == "Frank Lowy"][['name', 'year', 'worth']]

            name  year     worth
661   Frank Lowy  1997       NaN
1025  Frank Lowy  1998  4849.049
662   Frank Lowy  1999       NaN
661   Frank Lowy  2000       NaN
2336  Frank Lowy  2001  2200.000
2420  Frank Lowy  2002  2100.000
2356  Frank Lowy  2003  1800.000
2390  Frank Lowy  2004  2400.000
2373  Frank Lowy  2005  3600.000
2341  Frank Lowy  2006  3800.000
2242  Frank Lowy  2007  4600.000
2184  Frank Lowy  2008  4600.000
2318  Frank Lowy  2009  2700.000
2177  Frank Lowy  2010  3600.000
2043  Frank Lowy  2011  4400.000
1987  Frank Lowy  2012  4400.000
1838  Frank Lowy  2013  5300.000
1757  Frank Lowy  2014  4700.000
1600  Frank Lowy  2015  4900.000
1471  Frank Lowy  2016  5100.000
1301  Frank Lowy  2017  5600.000
1143  Frank Lowy  2018  5900.000
997   Frank Lowy  2019  6500.000
1050  Frank Lowy  2020  4800.000
691   Frank Lowy  2021  5200.000

In [30]:
name = 'Dhanin Chearavanont'

In [31]:
res[res.name == name][['name', 'year', 'worth']]

                     name  year    worth
517   Dhanin Chearavanont  1997      NaN
516   Dhanin Chearavanont  1998      NaN
517   Dhanin Chearavanont  1999      NaN
517   Dhanin Chearavanont  2000      NaN
468   Dhanin Chearavanont  2001      NaN
2521  Dhanin Chearavanont  2002   1300.0
2433  Dhanin Chearavanont  2003   1300.0
2484  Dhanin Chearavanont  2004   1700.0
2558  Dhanin Chearavanont  2005   1700.0
2454  Dhanin Chearavanont  2006   2400.0
2433  Dhanin Chearavanont  2007   2400.0
2762  Dhanin Chearavanont  2008   1300.0
2625  Dhanin Chearavanont  2009   1300.0
2391  Dhanin Chearavanont  2010   2100.0
1946  Dhanin Chearavanont  2011   6500.0
1878  Dhanin Chearavanont  2012   7000.0
1665  Dhanin Chearavanont  2013  14300.0
1534  Dhanin Chearavanont  2014  11400.0
1357  Dhanin Chearavanont  2015  13600.0
1375  Dhanin Chearavanont  2016   6800.0
1159  Dhanin Chearavanont  2017   9700.0
939   Dhanin Chearavanont  2018  14900.0
824   Dhanin Chearavanont  2019  15200.0
774   Dhanin Chearavanont  2020  13500.0
253   Dhanin Chearavanont  2021  18100.0

In [32]:
tb[tb.name == name][['name', 'year', 'networthusbillion']]

                      name            year  networthusbillion
10442  Dhanin Chearavanont          1996.0                4.2
10443  Dhanin Chearavanont          1997.0                1.7
10446  Dhanin Chearavanont          2000.0                1.2
10449  Dhanin Chearavanont          2002.0                1.3
10451  Dhanin Chearavanont          2003.0                1.3
10453  Dhanin Chearavanont          2004.0                1.7
10457  Dhanin Chearavanont          2005.0                1.7
10459  Dhanin Chearavanont          2006.0                2.4
10461  Dhanin Chearavanont          2007.0                2.4
10465  Dhanin Chearavanont          2008.0                1.3
10469  Dhanin Chearavanont          2009.0                1.3
10472  Dhanin Chearavanont          2010.0                2.1
10475  Dhanin Chearavanont          2011.0                6.5
10480  Dhanin Chearavanont          2012.0                7.0
10483  Dhanin Chearavanont          2013.0               14.3
10512  Dhanin Chearavanont          2015.0               13.6
10527  Dhanin Chearavanont  September 2015               11.5

In [34]:
name = 'Emilio Azcarraga Jean'

In [35]:
tb[tb.name == name][['name', 'year', 'networthusbillion']]

                       name            year  networthusbillion
8106  Emilio Azcarraga Jean          1996.0                2.0
8115  Emilio Azcarraga Jean          1997.0                1.6
8122  Emilio Azcarraga Jean          1998.0                3.5
8126  Emilio Azcarraga Jean          1999.0                2.1
8148  Emilio Azcarraga Jean          2000.0                1.5
8152  Emilio Azcarraga Jean          2001.0                3.0
8173  Emilio Azcarraga Jean          2002.0                1.0
8201  Emilio Azcarraga Jean          2005.0                1.0
8209  Emilio Azcarraga Jean          2006.0                1.7
8220  Emilio Azcarraga Jean          2007.0                2.1
8228  Emilio Azcarraga Jean          2008.0                1.6
8237  Emilio Azcarraga Jean          2009.0                1.0
8250  Emilio Azcarraga Jean          2010.0                1.5
8257  Emilio Azcarraga Jean          2011.0                2.3
8275  Emilio Azcarraga Jean          2012.0                2.0
8277  Emilio Azcarraga Jean          2013.0                2.5
8304  Emilio Azcarraga Jean          2014.0                2.6
8314  Emilio Azcarraga Jean          2015.0                3.1
8330  Emilio Azcarraga Jean  September 2015                2.6

In [36]:
res[res.name == name][['name', 'year', 'worth']]

                       name  year     worth
592   Emilio Azcarraga Jean  1997       NaN
2462  Emilio Azcarraga Jean  1998  1127.458
593   Emilio Azcarraga Jean  1999       NaN
592   Emilio Azcarraga Jean  2000       NaN
2287  Emilio Azcarraga Jean  2001  3000.000
2580  Emilio Azcarraga Jean  2002  1000.000
538   Emilio Azcarraga Jean  2003       NaN
522   Emilio Azcarraga Jean  2004       NaN
2726  Emilio Azcarraga Jean  2005  1000.000
2560  Emilio Azcarraga Jean  2006  1700.000
2485  Emilio Azcarraga Jean  2007  2100.000
2643  Emilio Azcarraga Jean  2008  1600.000
2749  Emilio Azcarraga Jean  2009  1000.000
2582  Emilio Azcarraga Jean  2010  1500.000
2308  Emilio Azcarraga Jean  2011  2300.000
2378  Emilio Azcarraga Jean  2012  2000.000
2196  Emilio Azcarraga Jean  2013  2500.000
2102  Emilio Azcarraga Jean  2014  2600.000
1853  Emilio Azcarraga Jean  2015  3100.000
2060  Emilio Azcarraga Jean  2016  2100.000
2002  Emilio Azcarraga Jean  2017  2100.000
2242  Emilio Azcarraga Jean  2018  1700.000
2569  Emilio Azcarraga Jean  2019  1200.000
148   Emilio Azcarraga Jean  2020       NaN
27    Emilio Azcarraga Jean  2021       NaN

In [37]:
name = "Bill Gates"

In [38]:
res[res.name == name][['name', 'year', 'worth']]

            name  year     worth
244   Bill Gates  1997       NaN
244   Bill Gates  1998       NaN
244   Bill Gates  1999       NaN
245   Bill Gates  2000       NaN
2167  Bill Gates  2001   58700.0
2268  Bill Gates  2002   52800.0
2180  Bill Gates  2003   40700.0
2213  Bill Gates  2004   46600.0
2245  Bill Gates  2005   46500.0
2185  Bill Gates  2006   50000.0
2085  Bill Gates  2007   56000.0
1977  Bill Gates  2008   58000.0
2089  Bill Gates  2009   40000.0
1925  Bill Gates  2010   53000.0
1797  Bill Gates  2011   56000.0
1744  Bill Gates  2012   61000.0
1609  Bill Gates  2013   67000.0
1438  Bill Gates  2014   76000.0
1277  Bill Gates  2015   79200.0
1205  Bill Gates  2016   75000.0
1028  Bill Gates  2017   86000.0
846   Bill Gates  2018   90000.0
751   Bill Gates  2019   96500.0
695   Bill Gates  2020   98000.0
154   Bill Gates  2021  124000.0

## Notes:

1. The data from API seems not correct for year 1997-2001
2. NaNs seems to mean the person is not in the list of given year

In [6]:
res.columns

Index(['name', 'lastName', 'uri', 'imageUri', 'worthChange', 'age', 'source',
       'industry', 'gender', 'country', 'timestamp', 'headquarters', 'state',
       'realTimeWorth', 'realTimeRank', 'realTimePosition', 'squareImage',
       'worth', 'position', 'rank', 'year', 'title', 'government', 'salary',
       'managementAssets', 'pay'],
      dtype='object')

In [7]:
tb.columns

Index(['name', 'year', 'rank', 'citizenship', 'countrycode',
       'networthusbillion', 'age', 'sourceofwealth', 'IndustryAggregates',
       'north', 'region', 'industry', 'company', 'deflator1996',
       'realnetworth', 'realbillionaires', 'gdpcurrentus'],
      dtype='object')

In [10]:
len(tb.name.unique())

3242

In [11]:
len(res.name.unique())

4576

In [12]:
d = set(tb.name.unique().tolist()) - set(res.name.unique().tolist())

In [13]:
len(d)

890

In [14]:
d2 = set(res.name.unique().tolist()) - set(tb.name.unique().tolist())
len(d2)

2224

In [18]:
res_worth = res.set_index(['name', 'year'])['worth']
tb_worth  = tb.set_index(['name', 'year'])['networthusbillion']

In [22]:
res_fill = res_worth.fillna(tb_worth)

In [23]:
res_fill

name                                   year
A. Jayson Adair                        1997       NaN
Abdulla Al Futtaim & family            1997       NaN
Abdulla bin Ahmad Al Ghurair & family  1997       NaN
Abdulsamad Rabiu                       1997       NaN
Abhay Firodia                          1997       NaN
                                                ...
Daniel Yong Zhang                      2021    1000.0
Zhang Yuqiang                          2021    1000.0
Zhao Meiguang                          2021    1000.0
Zhong Naixiong                         2021    1000.0
Zhou Wei family                        2021    1000.0
Name: worth, Length: 71271, dtype: float64

In [26]:
name = "Abdulla Al Futtaim & family"

In [27]:
tb[tb.name == name][['name', 'year', 'networthusbillion']]

Empty DataFrame
Columns: [name, year, networthusbillion]
Index: []

In [30]:
res_worth.dropna().sort_index()

name                  year
A. Jayson Adair       2021    1000.0
A. Jerrold Perenchio  2001    3000.0
                      2002    2600.0
                      2003    2300.0
                      2004    2700.0
                               ...
Zygmunt Solorz-Zak    2017    2500.0
                      2018    2800.0
                      2019    2700.0
                      2020    2400.0
                      2021    3200.0
Name: worth, Length: 31623, dtype: float64

In [31]:
res_fill.dropna().sort_index()

name                  year
A. Jayson Adair       2021    1000.0
A. Jerrold Perenchio  2001    3000.0
                      2002    2600.0
                      2003    2300.0
                      2004    2700.0
                               ...
Zygmunt Solorz-Zak    2017    2500.0
                      2018    2800.0
                      2019    2700.0
                      2020    2400.0
                      2021    3200.0
Name: worth, Length: 31873, dtype: float64

In [34]:
n1 = res[['name', 'lastName', 'gender', 'country']].drop_duplicates()

In [36]:
n2 = tb[['name', 'citizenship']].drop_duplicates()

In [110]:
n1.to_csv('forbes.names.csv', index=False)
n2.to_csv('tb.names.csv', index=False)

In [5]:
from ddf_utils.str import to_concept_id

In [106]:
res2 = res.copy()
tb2 = tb.copy()

In [105]:
def cleanup(s):
    if isinstance(s, str):
        s_new = s.strip()
        if s_new.endswith('& family'):
            s_new = s_new[:-9]
        if "&#38;" in s_new:
            s_new = s_new.replace("&#38;", '')
        return to_concept_id(s_new)
    else:
        return s

In [11]:
cleanup('Test & family')

'test'

In [107]:
res2['person'] = res2['name'].map(cleanup)
res2['country'] = res2['country'].map(cleanup)
res2['industry'] = res2['industry'].map(cleanup)

In [108]:
tb2['person'] = tb2['name'].map(cleanup)
tb2['citizenship'] = tb2['citizenship'].map(cleanup)
tb2['industry'] = tb2['industry'].map(cleanup)

In [109]:
n1 = res2[['person', 'name', 'country', 'industry']].drop_duplicates(subset=['person'])
n2 = tb2[['person', 'name', 'citizenship', 'industry']].drop_duplicates(subset=['person'])

In [38]:
res2[res2.person == 'alexandra_schoerghuber'][['name', 'year', 'worth', 'uri']]

                        name  year   worth                     uri
66    Alexandra Schoerghuber  1997     NaN  alexandra-schoerghuber
66    Alexandra Schoerghuber  1998     NaN  alexandra-schoerghuber
66    Alexandra Schoerghuber  1999     NaN  alexandra-schoerghuber
67    Alexandra Schoerghuber  2000     NaN  alexandra-schoerghuber
61    Alexandra Schoerghuber  2001     NaN  alexandra-schoerghuber
61    Alexandra Schoerghuber  2002     NaN  alexandra-schoerghuber
61    Alexandra Schoerghuber  2003     NaN  alexandra-schoerghuber
58    Alexandra Schoerghuber  2004     NaN  alexandra-schoerghuber
57    Alexandra Schoerghuber  2005     NaN  alexandra-schoerghuber
55    Alexandra Schoerghuber  2006     NaN  alexandra-schoerghuber
55    Alexandra Schoerghuber  2007     NaN  alexandra-schoerghuber
49    Alexandra Schoerghuber  2008     NaN  alexandra-schoerghuber
2339  Alexandra Schoerghuber  2012  2200.0  alexandra-schoerghuber
2242  Alexandra Schoerghuber  2013  2400.0  alexandra-schoerghuber
2070  Alexandra Schoerghuber  2014  2800.0  alexandra-schoerghuber
2077  Alexandra Schoerghuber  2015  2400.0  alexandra-schoerghuber
1836  Alexandra Schoerghuber  2016  2800.0  alexandra-schoerghuber
1584  Alexandra Schoerghuber  2017  3500.0  alexandra-schoerghuber
1297  Alexandra Schoerghuber  2018  4700.0  alexandra-schoerghuber
1153  Alexandra Schoerghuber  2019  4700.0  alexandra-schoerghuber
1222  Alexandra Schoerghuber  2020  3600.0  alexandra-schoerghuber
667   Alexandra Schoerghuber  2021  5500.0  alexandra-schoerghuber

In [41]:
tb2[tb2.person == 'alexandra_schorghuber'][['name', 'year', 'networthusbillion']]

                       name            year  networthusbillion
3384  Alexandra Schorghuber          2009.0                2.0
3431  Alexandra Schorghuber          2010.0                2.2
3478  Alexandra Schorghuber          2011.0                2.3
3510  Alexandra Schorghuber          2012.0                2.2
3616  Alexandra Schorghuber          2013.0                2.4
3642  Alexandra Schorghuber          2014.0                2.8
3715  Alexandra Schorghuber          2015.0                2.4
3826  Alexandra Schorghuber  September 2015                2.2

In [119]:
def is_broken_year_range(frame):
    years = frame['year']
    r1 = years.max() - years.min() + 1
    r2 = len(years) 
    return not (r1 == r2)

In [120]:
f = res2[res2.person == 'alexandra_schoerghuber'][['name', 'year', 'worth', 'uri']]
is_broken_year_range(f)

True

In [45]:
2021 - 1997

24

In [47]:
len(list(range(1997, 2022)))

25

In [89]:
def combine_values(frame):
    values = dict()
    for c in frame.columns:
        values[c] = '; '.join(frame[c].dropna().astype(str).unique())
    return pd.Series(values)

In [111]:
ent = res2.groupby('person')['name', 'country', 'industry'].apply(combine_values)

C:\Users\semio\AppData\Local\Temp/ipykernel_9956/4188459549.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  ent = res2.groupby('person')['name', 'country', 'industry'].apply(combine_values)

In [72]:
res.columns

Index(['name', 'lastName', 'uri', 'imageUri', 'worthChange', 'age', 'source',
       'industry', 'gender', 'country', 'timestamp', 'headquarters', 'state',
       'realTimeWorth', 'realTimeRank', 'realTimePosition', 'squareImage',
       'worth', 'position', 'rank', 'year', 'title', 'government', 'salary',
       'managementAssets', 'pay'],
      dtype='object')

In [98]:
import numpy as np

In [99]:
def get_last_value(frame):
    values = dict()
    for c in frame.columns:
        d = frame[c].dropna()
        if d.empty:
            values[c] = np.nan
        else:
            values[c] = d.iloc[-1]
    return pd.Series(values)

In [112]:
# ent_other = res2[['person', 'age', 'gender']].drop_duplicates(subset='person').set_index('person')
ent_other = res2.groupby('person')['age', 'gender'].apply(get_last_value)

C:\Users\semio\AppData\Local\Temp/ipykernel_9956/125550868.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  ent_other = res2.groupby('person')['age', 'gender'].apply(get_last_value)

In [113]:
ent_all = pd.concat([ent_other, ent], axis=1)

In [102]:
ent_all

,age,gender,name,country,industry
person,,,,,
a_jayson_adair,52.0,M,A. Jayson Adair,united_states,automotive
a_jerrold_perenchio,91.0,M,A. Jerrold Perenchio,united_states,media; media_entertainment
abdul_aziz_al_ghurair,67.0,M,Abdul Aziz Al Ghurair,united_arab_emirates,finance
abdul_majeed_alhokair,52.0,M,Abdul Majeed Alhokair,saudi_arabia,fashion_retail
abdul_rasyid,64.0,M,Abdul Rasyid,indonesia,manufacturing
...,...,...,...,...,...
ziyavudin_magomedov,53.0,M,Ziyavudin Magomedov,russia,energy
zong_qinghou,76.0,M,Zong Qinghou,china,food_beverage; food_and_beverage
zugen_ni,65.0,M,Zugen Ni,china,manufacturing
zuo_hui,51.0,M,Zuo Hui,china,real_estate
zygmunt_solorz_zak,65.0,M,Zygmunt Solorz-Zak,poland,media_entertainment; media

In [114]:
ent_all.to_csv('~/home/src/work/gapminder/datasets/repo/github.com/open-numbers/ddf--gapminder--forbes_billionaires/ddf--entities--person.csv')

In [115]:
dps = res2[['person', 'year', 'worth']].copy()

In [116]:
dps

                            person  year   worth
0                   a_jayson_adair  1997     NaN
1               abdulla_al_futtaim  1997     NaN
2     abdulla_bin_ahmad_al_ghurair  1997     NaN
3                 abdulsamad_rabiu  1997     NaN
4                    abhay_firodia  1997     NaN
...                            ...   ...     ...
2901             daniel_yong_zhang  2021  1000.0
2902                 zhang_yuqiang  2021  1000.0
2903                 zhao_meiguang  2021  1000.0
2904                zhong_naixiong  2021  1000.0
2905               zhou_wei_family  2021  1000.0

[71271 rows x 3 columns]

In [122]:
def check_groups(frame):
    n = frame.index[0]
    if is_broken_year_range(frame):
        print(n)
    return frame

In [124]:
gr = dps.set_index('person').groupby('person')

In [129]:
d = gr.get_group('zong_qinghou')
d

              year      worth
person
zong_qinghou  1997   8758.893
zong_qinghou  1998   8758.893
zong_qinghou  1999   8758.893
zong_qinghou  2000   8758.893
zong_qinghou  2001   8758.893
zong_qinghou  2002   8758.893
zong_qinghou  2003   8758.893
zong_qinghou  2004   8758.893
zong_qinghou  2005        NaN
zong_qinghou  2006        NaN
zong_qinghou  2010   7000.000
zong_qinghou  2011   5900.000
zong_qinghou  2012   6500.000
zong_qinghou  2013  11600.000
zong_qinghou  2014  11600.000
zong_qinghou  2015  10300.000
zong_qinghou  2016   6200.000
zong_qinghou  2017   7200.000
zong_qinghou  2018   9500.000
zong_qinghou  2019   8400.000
zong_qinghou  2020   8300.000
zong_qinghou  2021   8800.000

In [130]:
is_broken_year_range(d)

True

In [131]:
tb2[tb2.person == 'zong_qinghou'][['person', 'name', 'year', 'networthusbillion']]

            person          name            year  networthusbillion
1662  zong_qinghou  Zong Qinghou          2007.0                1.1
1688  zong_qinghou  Zong Qinghou          2008.0                1.0
1734  zong_qinghou  Zong Qinghou          2009.0                1.9
1796  zong_qinghou  Zong Qinghou          2010.0                7.0
1833  zong_qinghou  Zong Qinghou          2011.0                5.9
1983  zong_qinghou  Zong Qinghou          2012.0                6.5
2047  zong_qinghou  Zong Qinghou          2013.0               11.6
2265  zong_qinghou  Zong Qinghou          2014.0               11.6
2394  zong_qinghou  Zong Qinghou          2015.0               10.3
2536  zong_qinghou  Zong Qinghou  September 2015               10.4

In [128]:
gr.apply(check_groups)

abdul_majeed_alhokair
aerin_lauder
ahmet_nazif_zorlu
ahsen_ozokur
ajay_kalsi
alan_trefler
alberto_bailleres_gonzalez
aldo_bensadoun
alejandro_bulgheroni
alejandro_santo_domingo
alexander_dzhaparidze
alexander_knaster
alexander_lebedev
alexander_putilov
alexander_vik
alexandra_schoerghuber
alexei_ananyev
alexei_bogachev
alfred_mann
amar_bose
amos_hostetter_jr
ana_maria_marcondes_penido_sant_anna
anas_sefrioui
andre_koo_sr
andreas_struengmann
andrei_filatov
andrei_kuzyaev
andrei_rogachev
anne_gittinger
anton_kathrein_jr
antonia_ax_son_johnson
antonio_ermirio_de_moraes
antonio_gallardo_ballart
archie_aldis_emmerson
aubrey_mcclendon
aydin_dogan
ayman_hariri
bassam_alghanim
belmiro_de_azevedo
benjamin_de_rothschild
benjamin_zhengmin_pan
benny_subianto
bent_jensen
beom_su_kim
bernard_saul_ii
bidzina_ivanishvili
bill_and_jean_adderley
bill_austin
bill_gross
bill_marriott_jr
brad_jacobs
bruce_nordstrom
bulent_eczacibasi
cai_xiaoru
carlos_ardila_lulle
chang_woo_han
changpeng_zhao
charles_b_johnson
charles_zegar
che_fengsheng
che_jianxing
chen_fashu
chen_jinshi
chen_yihong
cheng_wei
chengjian_zhou
cher_wang_wenchi_chen
cheung_yan
chey_ki_won
chey_tae_won
cho_tak_wong
cho_yang_rai
chris_sacca
chris_wallin
chu_jinfu
chu_lam_yiu
chu_mang_yee
chuchat_petaumpai_daonapa_petampai
chung_mong_joon
cigdem_sabanci_bilen
clayton_riddell
clelia_haji_ioannou
clemmie_spangler_jr
d_leopoldo_del_pino
d_leopoldo_del_pino_y_calvo_sotelo
daisy_igel
dani_reiss
danil_khachaturov
dariusz_milek
david_davidovich
david_penaloza_alanis
david_reuben
dmitry_ananyev
dmitry_korzhev
dmitry_troitsky
dominika_kulczyk
donald_hall
donald_schneider
dorrance_hamilton
drayton_mclane_jr
du_jiangtao
eduardo_belmont_anderson
eduardo_cojuangco
eduardo_hochschild
edward_johnson_iii
edward_roski_jr
edwin_soeryadjaya
elie_horn
eliodoro_matte
eric_ya_shen
euisun_chung
fahed_hariri
fang_hongbo
faruk_eczacibasi
fawaz_alhokair
fawzi_al_kharafi
femi_otedola
ferit_faik_sahenk
filaret_galchev
frank_fertitta_iii
franziska_wuerbser_gabriella_meister
fred_smith
fu_guangming
fu_kwan
gao_dekang
gary_burrell
gautam_adani
gautam_thapar
geng_jianming
georg_schaeffler
george_ty
gerald_ford
gerald_harvey
gerald_j_ford
gerard_wertheimer
gerry_harvey
gina_rinehart
guangchang_guo
guilherme_peirao_leal
gunter_herz
guo_guangchang
h_ross_perot_jr
habil_khorakiwala
hansjoerg_wyss
harjo_sutanto
he_qiaonv
he_xiangjian
heloise_pratt
henry_cheng
henry_nicholas_iii
herb_simon
herbert_allen_jr
herbert_kohler_jr
herbert_simon
hiew_king_tiong
hinduja_brothers
hong_piow_teh
hope_hill_van_beuren
hua_xuande
huang_dawen
huang_maoru
huang_rulun
huang_shaowu
huang_shih_tsai
huateng_ma
hui_ka_yan
hui_wing_mau
ina_chan
ioan_niculae
irwin_jacobs
isaac_larian
j_b_pritzker
jack_dangermond
jacky_xu
jaime_zobel_de_ayala
james_coulter
james_irving
james_kim
jan_kulczyk
jean_paul_clozel
jeff_skoll
jeff_t_green
jeffery_hildebrand
jennifer_pritzker
jensen_huang
jiang_bin
jiang_ganjun
jim_coulter
jim_davis
jim_simons
jin_lei
joe_lewis
joe_mansueto
john_a_sobrato
john_arrillaga
john_doerr
john_dorrance_iii
john_marriott
john_menard_jr
jon_huntsman
jonathan_harmsworth
jorge_gallardo_ballart
jorge_rodriguez_rodriguez
jose_and_francisco_jose_calderon_rojas
jose_isaac_peres
jose_llado_fernandez_urrutia
joyce_raley_teel
judith_neilson
julian_robertson
julian_robertson_jr
ke_xiping
kei_hoi_pang
keiichiro_takahara
ken_fisher
ken_griffin
ken_langone
kenji_kasahara
kenneth_langone
kenneth_lo
kenneth_morrison
keshub_mahindra
kim_taek_jin
klaus_michael_kuehne
konstantin_nikolaev
koo_bon_joon
kutayba_alghanim
kwee_brothers
l_john_doerr
lai_meisong
larry_ellison
larry_yung
law_kar_po
lee_family
lee_jay_hyun
lee_man_tat
lee_shau_kee
len_blavatnik
les_wexner
leszek_czarnecki
li_ka_shing
li_li
li_san_yim
li_sze_lim
li_weiguo
li_yihai
li_yong
li_zhen
li_zhenjiang
lia_maria_aguiar
liang_wengen
lin_li
lin_shu_hong
lina_maria_aguiar
liu_canglong
liu_gexin
liu_ming_chung
liu_yonghao
liu_yongxing
liu_zhiqiang
lottie_tham
lou_zhongfu
lowell_milken
lu_zhiqiang
lucio_and_susan_co
lui_che_woo
ma_hong
ma_xingtian
madeleine_olsson_ericksson
maggie_hardy_knox
maggie_magerko
manny_stul
marcel_adams
marguerite_harbert
maria_de_lourdes_egydio_villela
maria_del_pino
maria_elisabeth_georg_schaeffler
maria_elisabeth_schaeffler_thumann
marian_ilitch
mark_haoyong_yang
matthew_bucksbaum
matthew_calkins
meg_whitman
mehmet_emin_karamehmet
mehmet_hattat
mehmet_omer_koc
mehmet_rustu_basaran
michael_rainer_schmidt_ruthenbeck
mikhail_balakin
ming_hsieh
mohammed_al_issa
mohannad_al_kharafi
mong_koo_chung
muneaki_masuda
mustafa_rahmi_koc
mustafa_vehbi_koc
nevaldo_rocha
nicholas_pritzker
nikita_mishin
nikolai_sarkisov
nurzhan_subkhanberdin
o_bruton_smith
oleg_deripaska
olgun_zorlu
onsi_sawiris
or_wai_sheun
ou_xueming
ou_zonghong
paul_tudor_jones_ii
paul_xiaoming_lee
peng_hao
peter_lewis
phil_ruffin
phillip_t_terry_ragon
polys_haji_ioannou
quek_leng_chan
radhakishan_damani
rafael_del_pino
ralph_sonnenberg
ramesh_chandra
randa_duncan_williams
randal_j_kirk
reinhold_wuerth
richard_chilton_jr
richard_elman
richard_marriott
richard_qiangdong_liu
rit_thirakomen
rob_walton
robert_f_smith
robert_miller
robert_rich_jr
roger_wang
ron_burkle
rupert_johnson_jr
ryan_graves
s_truett_cathy
saad_hariri
salman_alhokair
sam_zell
sameer_gehlaut
samih_sawiris
samuel_wyly
sanford_weill
satoshi_suzuki
sefik_yilmaz_dizdar
semahat_sevim_arsel
sergei_petrov
sergei_sarkisov
serra_sabanci
sevket_sabanci
sheldon_adelson
shen_wenrong
sheng_jian_zhong
shi_yuzhu
shin_dong_guk
shin_dong_joo
shishir_bajaj
shoji_uehara
soegiarto_adikoesoemo
stanley_hubbard
stanley_kroenke
stanley_perron
stanley_stub_hubbard
stephen_saad
steve_case
steve_cohen
steve_wynn
steven_roth
suat_gunsel
sudhir_samir_mehta
suh_kyung_bae
sun_guangxin
sun_shangchuan
sun_weijie
suna_kirac
suzan_sabanci_dincer
sylvia_stroeher
tang_yiu
ted_lerner
ted_turner
teh_hong_piow
tetsuro_funai
theo_albrecht_jr
thomas_struengmann
tiong_lay_yeoh
tom_golisano
tsai_cheng_da
tsai_cheng_ta
tsai_chi_jui
tsai_eng_meng
tsai_hong_tu
tseng_cheng
tung_chee_chen
turgay_ciner
v_prem_watsa
valentin_gapontsev
venugopal_dhoot
viatcheslav_kantor
victor_fung
vijay_mallya
vitaly_orlov
vyacheslav_kantor
wan_lianbu
wang_chuanfu
wang_jinshu
wang_jiufang
wang_muqing
wang_qunbin
wang_wei
wang_xicheng
wang_yanqing
wang_yong
wee_cho_yaw
wei_yin_chun
will_wei_cheng
willi_isolde_liebherr
william_ford_sr
william_fung
william_kellogg
william_lei_ding
william_wrigley_jr
winifred_j_marquart
wu_guangming
xie_ketao
xu_bo
yan_cheung
yang_huiyan
yang_zhimao
ye_yuanxi
yildirim_ali_koc
yongxing_liu
yu_minhong
yuri_gushchin
zeng_kaitian
zhang_cheng_fei
zhang_guiping
zhang_li
zhang_xin_pan_shiyi
zhang_yin
zhang_zhixiang
zhang_zhongneng
zhao_weiguo
zhaoxi_lu
zhong_sheng_jian
zhou_mingjie
zhou_yahui
zhou_yifeng
zhu_baoguo
zhu_wenchen
zhu_xingming
zong_qinghou

                 year   worth
person
a_jayson_adair   1997     NaN
a_jayson_adair   1998     NaN
a_jayson_adair   1999     NaN
a_jayson_adair   2000     NaN
a_jayson_adair   2001     NaN
...               ...     ...
yu_de_chao       2021  1000.0
zhang_yuqiang    2021  1000.0
zhao_meiguang    2021  1000.0
zhong_naixiong   2021  1000.0
zhou_wei_family  2021  1000.0

[71271 rows x 2 columns]